#include "led.h"
#include "lcd.h"
#include "key.h"
#include "pwm.h"
#include "usart3.h"
#include "beep.h"


/*********************************************************************************
**********************MCU启明 STM32F407应用开发板(高配版)*************************
**********************************************************************************
* 文件名称: 例程7 PWM输出主函数main.c                                            *
* 文件简述：PWM输出                                                              *
* 创建日期：2015.03.08                                                           *
* 版    本：V1.0                                                                 *
* 作    者：Clever                                                               *
* 说    明：按键控制输出不同占空比的PWM波,需示波器观察                           *
* 淘宝店铺：https://shop125046348.taobao.com                                     *
**********************************************************************************
*********************************************************************************/




int i,A0,A7,B0,B1,B4,B5,D12,D13,E6;
int main()
{ 
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);//设置系统中断优先级分组2
	uart3_init(9600);	    //串口初始化波特率为9600
	BEEP_Init();          //蜂鸣器初始化
	delay_init();		      //初始化延时函数
	LED_Init();		        //初始化LED 
	KEY_Init();
	LCD_Init();
	BRUSH_COLOR=RED;      //设置画笔颜色为红色
	
	TIM3_PWM_Init(4200,1);	//84M/42=2Mhz的计数频率,重装载值40000，所以PWM频率为 2M/40000=50hz.  


	
	//go(3000,1,4200,3000,4200,4,0,1,1);
	//delay_ms(1000);
/*	go(3000,4200,1,3000,1,4200,0,1,1);
	delay_ms(1000);
	
	go(3000,1,4200,0,1,1,3000,4200,1);
	delay_ms(1000);
	go(3000,4200,1,0,1,1,3000,1,4200);
	delay_ms(1000);
	
	go(0,1,1,3000,1,4200,3000,4200,1);
	delay_ms(1000);
	go(0,1,1,3000,4200,1,3000,1,4200);
	delay_ms(1000);	
*/
	//go(0,1,1,0,1,1,0,1,1);
	
	
		while(1)
	{
		key_scan(0);
		
		if(keyup_data==KEY0_DATA)
		  {
		   uart3SendChars("UART3 TEST",11);
		  }
	}
	
}	
